# Circuits Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanTopology..::..Circuits Property
PlanTopology Class See Also
---
The Circuits of the PlanTopology.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PlanCircuitSet Circuits { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Circuits As PlanCircuitSet
	Get
```

Visual C++
---
```text
public:
property PlanCircuitSet^ Circuits {
	PlanCircuitSet^ get ();
}
```

# See Also
PlanTopology Class
Autodesk.Revit.DB Namespace